[{"username": "nkdumas", "tweets": [{"content": "Really fascinating.  Also interesting (but not surprising) that ideological self-id was much less predictive in 2016. https://t.co/BvgApfsVzs", "created_at": "2018-05-04 03:41:45"}, {"content": "@cwarshaw Self-reported participation in protests, marches, or other public demonstrations would be interesting to see.  There's some older survey work on that, but very little recently that's representative.", "created_at": "2018-05-02 16:13:43"}, {"content": "@jpodhoretz You should check with Louise Mensch first just to be sure though.", "created_at": "2018-04-30 21:09:37"}, {"content": "This is very stressful. https://t.co/94cQy7UtSy", "created_at": "2018-04-30 20:42:42"}, {"content": "@a_strezh He has never opposed or taken actions against US membership in TPP.  Period.", "created_at": "2018-04-12 19:26:22"}, {"content": "@ArielDumas I think you're opening some dark fan-fiction doors you don't want to be opening...", "created_at": "2018-04-10 02:38:19"}, {"content": "@Patrick_J_Egan @Google You're in the control group! But thanks for the SUTVA violation now...", "created_at": "2018-04-09 11:58:48"}, {"content": "There is no emotion, there is peace.  There is no ignorance, there is knowledge. There is no chaos, there is GREAT ENERGY!! https://t.co/v5zar3tz6G", "created_at": "2018-03-06 14:29:27"}, {"content": "IMO, the most overlooked part of this Ben Carson scandal is that anyone would have $31k to spend on dining on furniture, and then select items as tacky and ugly as these. #midcenturymodernalltheway https://t.co/KBJhRc9Vkd https://t.co/96Mq1kWbi5", "created_at": "2018-03-03 15:54:03"}, {"content": "This is a totally crazy idea, but what if...and I'm just spit-balling here...people, especially ones with as many glaring red flags, weren't allowed to purchase semi-automatic weapons? https://t.co/zU33zyES3J", "created_at": "2018-02-15 13:19:20"}, {"content": "Even compared to his colleagues, Marco Rubio's extreme spinelessness is a medical marvel. https://t.co/YzAcTQfVsX", "created_at": "2018-02-15 13:16:57"}, {"content": "@jdbk THOSE ARE THE ILLEGAL NON-CITIZEN VOTES FROM PEOPLE BROUGHT IN FROM BENGHAZI ON CLINTON FOUNDATION BUSES THAT HILLARY WAS EMAILING ABOUT ON HER WIPED SERVER!!! #WAKEUP #SHEEPLE #CONNECTTHEDOTS", "created_at": "2018-02-12 16:32:57"}, {"content": "@amber_spry @BrandeisU Congratulations!! Welcome to the greater Boston area!", "created_at": "2018-02-10 23:40:21"}, {"content": "@dandekadt @TimesLIVE Woah.  Also, can we nominate another world leader to also step down at the same time? Some sort of pairing system?", "created_at": "2018-02-06 22:30:01"}, {"content": "This...cannot be reality. https://t.co/Q1k4OOv8SQ", "created_at": "2018-02-06 03:24:10"}, {"content": "@dandekadt @The_JOP @ucmerced @Harvard These are really cool plots!", "created_at": "2018-01-18 22:09:04"}, {"content": "Trump's support is definitely entirely about economic outcomes and policies. https://t.co/hSrsl9CTlZ", "created_at": "2018-01-11 23:00:07"}, {"content": "*Sips tea* https://t.co/zUD057Uim7", "created_at": "2017-12-18 22:14:19"}, {"content": "@AdamBerinsky @AlbertsonB2 Hopefully not when reading my work!", "created_at": "2017-12-12 00:55:39"}, {"content": "Does anyone know of an education lawyer who's barred in New Hampshire? A friend of mine with a disability is having an issue with their university, and has been trying in vain to find representation.", "created_at": "2017-12-11 21:51:29"}, {"content": "The APSR called to say that they were PROBABLY going to publish every paper in my diss, but I would have to submit it in Word. I said probably is no good and took a pass. Thanks anyway!", "created_at": "2017-11-25 01:01:34"}, {"content": "The fact that at least one of those polls puts Obama's approval over Trump's suggests this is a partisan non-response story more than a \"voters leaving Moore\" story. https://t.co/orZVjVZ6n0", "created_at": "2017-11-17 22:01:08"}, {"content": "I actually think this is a really bad idea. Superdelegates have never been pivotal, and usually wouldn't, but can be an important guard against nominating someone unfit or unqualified (since by general election time, it's largely too late). https://t.co/M1ehUMgR3L", "created_at": "2017-11-15 23:39:42"}, {"content": "@dandekadt @sgadarian @AlbertsonB2 Perhaps this is some elaborate scheme by Mnuchin to sabotage the White House from within. He's creating images for all 2018 and 2020 Dem campaigns.", "created_at": "2017-11-15 23:25:47"}, {"content": "What a courageous hero. https://t.co/aHojYxXsAb", "created_at": "2017-11-15 22:11:53"}, {"content": "@Patrick_J_Egan I'm not so sure. The precincts that swung CA against prop 8 were largely suburban areas with lots of parents in the Bay Area. Emphasizing the (false) threats of SSM to children and to parenting is effective.", "created_at": "2017-11-15 21:54:13"}, {"content": "According to this article, Moore is comparing himself to Jesus.  What a complete sociopath. https://t.co/PbpyAVVDEc", "created_at": "2017-11-10 17:13:54"}, {"content": "He's deeply unwell and unfit. https://t.co/MNg5FXo18c", "created_at": "2017-11-08 18:47:06"}, {"content": "This tweet from &lt; 40 minutes ago has already aged well. https://t.co/uV7uL3hxgw", "created_at": "2017-10-30 15:02:46"}, {"content": "@dandekadt @JohnHolbein1 @AJPS_Editor @ethanbdm The mayor won because he had the best record on preventing shark attacks of any mayor ever.  Period.", "created_at": "2017-10-23 17:40:25"}, {"content": "@DrTomD_OG @dandekadt Oh gotcha.  I guess I assumed they formally tested for the null of no effect.  Given sample size, seems more plausible.  But that's fair.", "created_at": "2017-10-21 20:22:56"}, {"content": "@dandekadt I actually don't think the headline was that bad. What about it did you find clickbaity-y? Honest question. \n\n(Also, super cool paper)", "created_at": "2017-10-20 23:48:24"}, {"content": "@RadioFreeTom Although likely voter screens are pretty iffy, esp. in special elections (also, 2016), so idk that this is less reliable than the others.", "created_at": "2017-10-17 23:08:04"}, {"content": "Fun fact: 007 movie \"Licence to Kill\" was changed from \"Licence Revoked\" bc of fear that Americans wouldn't know what \"revoked\" meant. https://t.co/U24ERzqmXP", "created_at": "2017-10-12 21:13:26"}, {"content": "@dandekadt I'm tired of the winning.", "created_at": "2017-10-11 02:17:24"}, {"content": "@Patrick_J_Egan Since it's West Village, I'm assuming those are each only around $275.", "created_at": "2017-10-11 01:38:17"}, {"content": "@matt_blackwell There are a select, elite few who know exactly what he meant.", "created_at": "2017-10-10 14:08:00"}, {"content": "The thing that I find so infuriating is that these people continue to believe that *they* are the victims and that others are the swamp. https://t.co/0NU8nVNpHe", "created_at": "2017-10-05 03:06:46"}, {"content": "But he didn't deny it... https://t.co/VowHzl8quO", "created_at": "2017-10-04 15:22:09"}, {"content": "@JasonSclar There is clearly one major policy change that will stop this problem: slashing taxes for the top 1%.", "created_at": "2017-10-02 15:13:34"}, {"content": "They're going to replace it with Studies of Guys Sitting in their Bed that Weigh 400 Pounds. https://t.co/SM0UXR57Vc", "created_at": "2017-10-02 14:55:32"}, {"content": "@dandekadt Two LIBERAL college professors agree that piece by conservative should get a bad grade. #causalProof #collusion #bias #draintheswamp", "created_at": "2017-09-27 18:11:14"}, {"content": "@aecoppock BIG if true.", "created_at": "2017-09-21 23:21:32"}, {"content": "@JasonSclar @MayyaKomis Or decided to do it only in counties above a very specific population.  Be still my heart...", "created_at": "2017-09-21 17:45:54"}, {"content": "@dandekadt A lot of WINNING.", "created_at": "2017-09-20 22:06:57"}, {"content": "@dandekadt Oh, just googled it.  I missed that story originally.", "created_at": "2017-09-20 22:03:24"}, {"content": "@dandekadt Lufthansa goes to Windhoek via Johannesburg.", "created_at": "2017-09-20 22:00:20"}, {"content": "@dandekadt That is incredible.", "created_at": "2017-09-20 21:51:06"}, {"content": "@Patrick_J_Egan @HillaryClinton Does that model control for the 17 million illegal dead fraudulent Clinton voters???", "created_at": "2017-09-12 17:36:06"}, {"content": "According to 2 anon. sources, Ivanka and Jared were summering in Nantucket, otherwise they would have persuaded Trump not to pardon Arpaio.", "created_at": "2017-08-26 02:31:47"}, {"content": "@dandekadt @mirandayaver @dandekadt you seem awfully quick to quash the retoids-from-another-planet investigations...", "created_at": "2017-08-22 00:48:24"}, {"content": "@benshapiro It's true that Dems are unparalleled at snatching defeat from jaws of victory, but those numbers are noteworthy and bad for T. https://t.co/6DD9nx2M9p", "created_at": "2017-08-20 15:47:51"}, {"content": "Fun fact: the robe was b/c in orig. script, he's with a woman and then gets interrupted by Marcus.  Scene before got cut, but robe didn't. https://t.co/D9S1VmRZOy", "created_at": "2017-08-20 15:46:28"}, {"content": "Awful.  But important to consider how many people have been victims of non-data-driven judicial decisions. https://t.co/c8WYYOcAO0", "created_at": "2017-08-19 00:07:59"}, {"content": "This is amazing. https://t.co/M29N1Tuu2a", "created_at": "2017-08-17 12:56:18"}, {"content": "@ArielRWhite Paging Chief Justice Roberts.", "created_at": "2017-08-16 18:26:57"}, {"content": "Reminder that Pres. Trump personally called and thanked this excuse for a human being after his election. https://t.co/Fue90hP9TO", "created_at": "2017-08-14 18:27:21"}, {"content": "Something something irony. https://t.co/szPqTAG6VA", "created_at": "2017-08-14 02:03:35"}, {"content": "This is...quite a spin. https://t.co/kd6HFPU76a", "created_at": "2017-08-11 16:36:36"}, {"content": "@dandekadt @a_strezh My hope is that the more this happens, the lower his approval, which means even more defections, and more institutional resistance.", "created_at": "2017-08-02 00:43:33"}, {"content": "@dandekadt @a_strezh ...that this is good.  Plus, elites have the ability to influence public opinion, even if they don't follow through with policy.", "created_at": "2017-08-02 00:42:37"}, {"content": "@dandekadt @a_strezh I think that almost everything US legislators do is in the interest of (re)election (if not, they'd be selected out), but I still think...", "created_at": "2017-08-02 00:41:13"}, {"content": "A really important thread. https://t.co/JhWXpfIF1C", "created_at": "2017-07-26 21:42:01"}, {"content": "@cwarshaw We'll miss you! There's a Chris Warshaw Commemorative Item on the file drawer.  Some sort of bronze statuette.", "created_at": "2017-07-25 20:14:44"}, {"content": "@dandekadt @melissaleesands @romanmars What is that, a chair for ants?!?!", "created_at": "2017-07-19 15:49:53"}, {"content": "@a_strezh This is the most amazing thing on the internet.", "created_at": "2017-07-17 18:54:18"}, {"content": "@AdamBerinsky https://t.co/Sa35AVJwkg", "created_at": "2017-07-11 15:33:05"}, {"content": "This was incredibly hard to read. The opioid crisis has so many victims.   https://t.co/ZLDuKsXv83", "created_at": "2017-07-01 20:26:15"}, {"content": "This Tweet from @nkdumas has been withheld in: United States.", "created_at": "2017-06-30 08:33:11"}, {"content": "This 12-yo deserves so much better than to be cut off and shamed by adults who have no idea what it's like to be gay https://t.co/I38wN0OEem", "created_at": "2017-06-24 21:02:10"}, {"content": "@dandekadt @davidjbarney I've gotten the Christmas Eve Rejection Email.", "created_at": "2017-06-19 18:05:17"}, {"content": "@dandekadt @GOP Not as good as the options at Trump University, I'm sure.", "created_at": "2017-06-14 02:03:21"}, {"content": "@dandekadt @GOP That's because you're in the FAKE STATE of California. In REAL AMERICA, plans are amazing now, just terrific.  A very beautiful thing.", "created_at": "2017-06-14 00:41:07"}, {"content": "\"Few exceptions.\" Somewhere between 40 and 44, to be more precise. https://t.co/6HsZbgac8z", "created_at": "2017-06-12 16:25:21"}, {"content": "(2/2) \n3) Trump fires Mueller\n4) Many congressional R's defend Trump", "created_at": "2017-06-11 19:09:05"}, {"content": "(1/2) Prediction:\n1) Trolls release fake/misleading \"revelations\" about Mueller/Comey\n2) Fox &amp; Friends/ Limbaugh/ Hannity pick up on it...", "created_at": "2017-06-11 19:06:59"}, {"content": "How humanizing and not at all fake. https://t.co/UvYzY01kQ9", "created_at": "2017-06-10 22:03:53"}, {"content": "@StephenKing You must make the request while touching The Orb.", "created_at": "2017-06-09 21:49:00"}, {"content": "@a_strezh This line of questioning was so awkward and bizarre.", "created_at": "2017-06-08 16:39:22"}, {"content": "Thank goodness @JohnCornyn has courage to focus on what really matters: the Clinton emails.  I guess Area 51 is up next!", "created_at": "2017-06-08 16:23:00"}, {"content": "If Trump was \"naive\" and simply \"didn't know what he was doing\", then why did he ask everyone to leave the room before talking about Flynn?", "created_at": "2017-06-08 16:08:39"}, {"content": "@RosieGray \"Jr.\"", "created_at": "2017-06-08 15:55:06"}, {"content": "The Columbia Law School directory is down...", "created_at": "2017-06-08 15:53:12"}, {"content": "There should be a pre-testimony show where comedians stand outside the Capitol Building and make jokes about what the members are wearing.", "created_at": "2017-06-08 13:26:28"}, {"content": "@AdamBerinsky That's why I appreciate you telling me, on 3 separate occasions, that all my work is perfect in every way.", "created_at": "2017-06-08 13:25:19"}, {"content": "Missed opportunity: I should have started my prospectus defense by telling @AdamBerinsky: \"I need loyalty.  I expect loyalty.\"", "created_at": "2017-06-08 02:37:29"}, {"content": "@a_strezh Job killer.", "created_at": "2017-06-05 23:49:56"}, {"content": "@benshapiro 120-D Chess!", "created_at": "2017-05-19 19:50:34"}, {"content": "In his defense, Comey hiding against the wall and then extending his hand out far to avoid an awkward hug is me at every social event.", "created_at": "2017-05-19 17:59:40"}, {"content": "Also, switching gov't towards cloud-based computing (as opposed to a localized system) seems like a profoundly stupid security move. https://t.co/rbfpWWXzx3", "created_at": "2017-05-18 16:23:04"}, {"content": "@BillKristol @seanhannity In fact, he might spend 100% of the time discussing that and nothing else.", "created_at": "2017-05-18 01:27:29"}, {"content": "@AdamBerinsky Wait for it. (@dandekadt do you get it?)", "created_at": "2017-05-17 00:30:35"}, {"content": "I think the best defense is the same as intel leak: Trump totally out of his league, has no clue how gov't, or anything really, works. https://t.co/lUE1BBtYqK", "created_at": "2017-05-16 23:40:32"}, {"content": "@AdamBerinsky When you check your phone during intermission, you'll be able to read President Pence's inauguration speech!", "created_at": "2017-05-16 23:07:04"}, {"content": "2)...the damage from an impeachment or 25th am would be worse for their brand than sticking with him. This is just the beginning.", "created_at": "2017-05-16 15:25:51"}, {"content": "1) The really scary thing is that, short of cataclysmic disaster (real possibility), GOP leadership will think (possibly correctly) that...", "created_at": "2017-05-16 15:24:11"}, {"content": "Truly shameful behavior from adults who should have known better. https://t.co/JevlhIluZ4", "created_at": "2017-05-16 14:14:17"}, {"content": "#25thamendment", "created_at": "2017-05-15 23:12:55"}, {"content": "\"In case\" the all-GOP effort crashes. https://t.co/x5YAIUpX7g", "created_at": "2017-05-14 21:16:29"}, {"content": "@jmartNYT @JamesRosenTV It's the one with Andrew Jackson.", "created_at": "2017-05-13 03:35:39"}, {"content": "Donald Trump is to unforced errors what Stephen Sondheim is to musicals.", "created_at": "2017-05-12 18:08:05"}, {"content": "@dandekadt @MIT @MITPoliSci Looks super cool! California in general does a really good job of data openness, like their policing data.  #yourfuturestate #sojealous", "created_at": "2017-05-12 00:27:16"}, {"content": "@dandekadt I think we should take a cue from Trump spokesperson and let this Russia investigation go. There's clearly nothing to see here.", "created_at": "2017-05-10 01:43:05"}, {"content": "@JoeNBC HAHAHAHAHAHAHAHAHAHAHAHA *catches breath* HAHAHAHAHAHA", "created_at": "2017-05-10 01:36:01"}, {"content": "That slide showing Trump and chairs of Senate Judiciary Com as key decision makers for EB-5 is a really bizarre view of legislative process.", "created_at": "2017-05-07 22:21:12"}, {"content": "Well said. https://t.co/C3LlcleuXO", "created_at": "2017-05-04 14:32:11"}, {"content": "@dandekadt @jessesingal I have profoundly failed at threading tweets/being consistent with numbers.  It's just a puzzle! Decode my message!", "created_at": "2017-05-03 19:04:22"}, {"content": "@dandekadt @jessesingal Bannon, Trump's lies/corruption, Russia, etc., I just think this is a much smaller issue, in terms of number and power of those involved.", "created_at": "2017-05-03 19:03:54"}, {"content": "@dandekadt @jessesingal Behaved badly (she should sue the journal), but a) most academics, even Democrats, are more responsible, and compared to...", "created_at": "2017-05-03 19:02:55"}, {"content": "@dandekadt @jessesingal 2) an open empirical question.  But beyond that, I just think the scales are COMPLETELY different here. Yes, a small subset of academics...", "created_at": "2017-05-03 19:01:33"}, {"content": "@dandekadt @jessesingal 1) I would agree that it diminishes left's credibility, but not sure it *causes* the rise of the far-right (it might; I just think it's...", "created_at": "2017-05-03 19:00:49"}, {"content": "@dandekadt @jessesingal Agree, though my quibble more generally is leftwing extremism currently much less of a threat than rightwing extremism, given govt' control.", "created_at": "2017-05-03 18:10:09"}, {"content": "Comey has said \"wizard\" or \"wizardry\" like 2000x in this hearing.  Along w/ \"zombie army,\" his testimony is like a D&amp;D campaign.", "created_at": "2017-05-03 14:49:20"}, {"content": "Everyone should follow @JasonKander. One of the wittiest twitter users.  Also cool campaign ads.  Also related to Kander of Cabaret fame.", "created_at": "2017-05-03 02:39:32"}, {"content": "@AdamBerinsky Final eval: \"Bad professor knows NOTHING about the material.  Lots of folks saying I know way more than him. Totally biased grading.  SAD!\"", "created_at": "2017-05-02 20:25:12"}, {"content": "@dandekadt FALSE FLAG OPERATION! That's just an agent of the corporatist media elite in a panda costume. Open your eyes people!!!!", "created_at": "2017-05-02 20:20:20"}, {"content": "@JoeNBC That's not a surprise, given all we know about cognitive dissonance and party ID. Question is if this still holds say 3 years out.", "created_at": "2017-04-23 14:37:38"}, {"content": "I just supported Regina Bateson on @Crowdpac! https://t.co/2eFaCmBzwg", "created_at": "2017-04-13 15:27:06"}, {"content": "@Nate_Cohn I know that O.C. looks good for Ds in 2018.  What's your take on a district like CA-4, if it draws a high-quality D challenger?", "created_at": "2017-04-13 14:01:56"}, {"content": "Because the GOP is just one vote in Congress away from repealing and replacing ObamaCare! https://t.co/6ziO6YFpoE", "created_at": "2017-04-09 00:54:54"}, {"content": "@jaketapper I'm surprised journalists from RT aren't coming along.", "created_at": "2017-03-09 17:53:44"}, {"content": "@davidfrum Perfect! When Trump's border tariff passes, that's how much an iPhone will cost.", "created_at": "2017-03-07 13:58:42"}, {"content": "GOP reaction to Ryan's plan is a great illustration of Mayhew's point re MOCs often caring about their actions over policy outcomes.", "created_at": "2017-03-07 13:58:08"}, {"content": "...no?\nhttps://t.co/993DpgNpiS", "created_at": "2017-03-01 21:30:32"}, {"content": "@AdamBerinsky @dandekadt *gets off Twitter and goes back to working more on his dissertation*", "created_at": "2017-03-01 20:28:13"}, {"content": "@FrankLuntz Poll watchers already skew in favor of Trump, though.  So to some degree, it's apples and oranges.", "created_at": "2017-03-01 20:12:27"}, {"content": "@dandekadt I'm pretty sure \"Nonexistent solutions to nonexistent problems\" could be my dissertation title.", "created_at": "2017-03-01 20:07:25"}, {"content": "@matt_blackwell Puns that bad should be penalized.", "created_at": "2017-03-01 20:01:32"}, {"content": "#PartisanRealignment https://t.co/pJJ8vP2WzN", "created_at": "2017-03-01 03:02:28"}, {"content": "To be fair, it's possible that this hour-long speech is only 224 words, and the rest is applause.", "created_at": "2017-03-01 02:56:12"}, {"content": "@matt_blackwell Lincoln was also very tough and very good on the cyber.", "created_at": "2017-03-01 02:37:40"}, {"content": "I don't think Trump knows what the term \"Free Trade\" means.", "created_at": "2017-03-01 02:37:00"}, {"content": "@dandekadt Because 1) Benghazi, 2) e-mails, and 3) the horrible leakers from the FBI and also the corrupt evil NYTimes.", "created_at": "2017-03-01 02:34:55"}, {"content": "@benshapiro Seeing which Senators rose for that and which didn't is...interesting. #realignment", "created_at": "2017-03-01 02:32:04"}, {"content": "It's as if the election, the superbowl, and the oscars were in a competition to see who could have the most dramatic twist ending...", "created_at": "2017-02-27 15:33:34"}, {"content": "@dandekadt restriction on free speech inherently. It seems qualitatively different from saying someone can't give a speech in general.", "created_at": "2017-02-21 01:37:05"}, {"content": "@dandekadt I agree.  This is why I've always been skeptical that declining to invite particular speakers for a commencement is a...", "created_at": "2017-02-21 01:36:16"}, {"content": "@ElliottRHams @EvrydayFeminism in fact be \"unlearned\" or affected by environment.", "created_at": "2017-02-21 01:33:35"}, {"content": "@ElliottRHams @EvrydayFeminism there's plausibly an evolutionary basis for homophily generally. Things like racial discrimination can...", "created_at": "2017-02-21 01:32:55"}, {"content": "@ElliottRHams @EvrydayFeminism evolutionary history didn't interact with other races.  Studies of babies show no sorting by race.  Though...", "created_at": "2017-02-21 01:31:31"}, {"content": "@ElliottRHams @EvrydayFeminism make no sense for there to be a specific module for sexual selection by race, because humans in deep...", "created_at": "2017-02-21 01:30:33"}, {"content": "@ElliottRHams @EvrydayFeminism The term you're looking for is sexual selection, not natural selection.  Both by Darwin.  Also, it would...", "created_at": "2017-02-21 01:29:51"}, {"content": "Would be interested in seeing stress-related health outcomes by PID, like Gerber &amp; Huber 2009. Would not be surprised by a \"Trump Effect.\" https://t.co/pNbk0piZha", "created_at": "2017-02-20 20:00:02"}, {"content": "@AdamBerinsky Really any sort of course...", "created_at": "2017-02-17 01:39:34"}, {"content": "@NickRiccardi @benshapiro But Trump's number includes ind. leaners, while Bush Sr. and Reagan numbers don't; direct comparison is tricky.", "created_at": "2017-02-17 01:22:58"}, {"content": "My first tweet, but I refuse to use that Hashtag #tooCoolForSchool #JustKiddingImInGradSchool", "created_at": "2016-08-25 01:07:12"}], "affiliation": "-", "company": "MIT"}]